app/controllers/api/v1/greetings_controller.rb

  def index
      @greetings = Greeting.all
      if @greetings.empty?
         json_response({msg: 'No Greetings at this time'}, 400)
      else
          render json: @greetings[rand(0...@greetings.length - 1)]
---
SELECT "greetings".* FROM "greetings"
SELECT 1 AS one FROM "greetings" LIMIT $1  [["LIMIT", 1]]